/*

    sxs_pixel_difinition

    v1.0 by Yuma Aoki (Kindai Univ.)
    
    参考資料 : ASTRO-H COORDINATES DEFINITIONS ASTH-SCT-020
    
    SXSのピクセル配置(Look-up View)

        -------------------
        |23|24|26|34|32|30|
        -------------------
        |21|22|25|33|31|29|
        -------------------
        |19|20|18|35|28|27|
        -------------------
        | 9|10|17| 0| 2| 1|
        -------------------
        |11|13|15| 7| 4| 3|
        -------------------
        |12|14|16| 8| 6| 5|
        -------------------

    Note : Pixel 12 is the calibration pixel   

*/

#ifndef SXS_PIXEL_DIFINITION
#define SXS_PIXEL_DIFINITION

// 要素番号:ピクセル番号(0--35) ,値:X座標(0--5)
static int xaxis_value_ref[36] = {
    3,5,4,5,4,5,4,3,3,
    0,1,0,0,1,1,2,2,2,
    2,0,1,0,1,0,1,2,2,
    5,4,5,5,4,4,3,3,3
};

// 要素番号:ピクセル番号(0--35) ,値:Y座標(0--5)
static int yaxis_value_ref[36] = {
    2,2,2,1,1,0,0,1,0,
    2,2,1,0,1,0,1,0,2,
    3,3,3,4,4,5,5,4,5,
    3,3,4,5,4,5,4,5,3
};

#endif
